{
  "backend/main.mo": "Empty Motoko actor placeholder with no logic.",
  "feature_evidence.json": "Feature evidence report listing implemented landing-page features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file in the project.",
  "frontend/index.css": "Tailwind base styles plus OKLCH color variables for light/dark themes and global background/foreground application.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component assembling all landing-page sections in order.",
  "frontend/src/components/landing/BenefitsSection.tsx": "Displays benefits in a responsive card grid using icons and hover effects.",
  "frontend/src/components/landing/ContactForm.tsx": "Validated contact form with fields, inline errors, and a timed success state.",
  "frontend/src/components/landing/ContactSection.tsx": "Contact section with WhatsApp/Call buttons and embedded contact form.",
  "frontend/src/components/landing/Footer.tsx": "Footer with logo, tagline, copyright, and caffeine.ai attribution.",
  "frontend/src/components/landing/HeroSection.tsx": "Hero section with logo header, headline, CTA, trust points, and illustration.",
  "frontend/src/components/landing/landingContent.ts": "Exports static landing page content including hero text, benefits, pricing tiers, testimonials, trust badges, and contact info.",
  "frontend/src/components/landing/LandingSection.tsx": "Reusable layout wrapper providing consistent section padding, headings, and container.",
  "frontend/src/components/landing/PricingSection.tsx": "Renders pricing tiers as styled cards with features, recommended highlighting, and a button that scrolls to the contact section.",
  "frontend/src/components/landing/TestimonialsSection.tsx": "Displays testimonial cards with quotes, ratings, and client info in a grid layout.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, typography rules, and utility shadows for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radius, shadows, fonts, animations, and plugins for typography and container queries.",
  "project_state.json": "Defines the current project state for building a premium, mobile‑responsive QuickOnline landing page with required sections, visual guidelines, and image assets. Lists implemented features, design requirements, and functional expectations for CTAs and the contact form."
}