{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister.",
  "feature_evidence.json": "Feature evidence report documenting a WhatsApp/Call number update and associated files and components.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing each frontend file’s purpose and role in the landing page app.",
  "frontend/index.css": "Tailwind base file defining OKLCH theme variables, light/dark mode tokens, and global background/text styles.",
  "frontend/index.html": "Root HTML file that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React component composing all landing sections in order.",
  "frontend/src/components/landing/BenefitsSection.tsx": "Renders benefit cards using icons and content from landingContent within a styled section.",
  "frontend/src/components/landing/ContactForm.tsx": "Client‑side validated contact form with success state and field-level error handling.",
  "frontend/src/components/landing/ContactSection.tsx": "Contact section offering WhatsApp and Call actions plus an embedded contact form.",
  "frontend/src/components/landing/Footer.tsx": "Footer with logo, tagline, copyright, and caffeine.ai attribution link.",
  "frontend/src/components/landing/HeroSection.tsx": "Hero section with logo header, headline, CTA button, trust points, and illustration image.",
  "frontend/src/components/landing/landingContent.ts": "Exports static landing page content including hero text, benefits, pricing tiers, testimonials, trust badges, and contact info.",
  "frontend/src/components/landing/LandingSection.tsx": "Reusable layout wrapper providing consistent spacing, titles, and styling for each landing page section.",
  "frontend/src/components/landing/PricingSection.tsx": "Displays pricing tiers with feature lists and CTAs, highlighting a recommended package.",
  "frontend/src/components/landing/TestimonialsSection.tsx": "Renders a testimonials grid using cards, pulling testimonial data and displaying ratings, quotes, and client info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on the current Internet Identity, auto‑refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, stored identity restoration, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode values, and utility classes for shadows and smooth scrolling.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the Internet Identity provider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, shadows, animations, and plugins for the project.",
  "project_state.json": "Describes the project’s current state, goals, visual direction, requirements, and implemented features for the landing page."
}